{
	"PPV-PAC-PEV":{
	   "lines":[
		  {
			 "label":"PV",
			 "valori":[
				2040,
				2655,
				3190,
				3690,
				4200,
				4825,
				5155,
				5470,
				5625,
				5705,
				6300,
				6840,
				7790,
				8700,
				9655,
				10580,
				11560,
				12160,
				12650,
				12890,
				12960
			 ],
			 "color":"blue",
			 "type":"spline",
			 "marker":"none"
		  },
		  {
			 "label":"AC",
			 "valori":[
				2075,
				2620,
				3140,
				3515,
				4090,
				4520,
				4875,
				5105,
				5285,
				5395,
				5990,
				6560,
				7450,
				8385,
				9315,
				10220,
				11220,
				11835,
				12360,
				12600,
				12670
			 ],
			 "color":"red",
			 "type":"spline",
			 "marker":"none"
		  },
		  {
			 "label":"EV",
			 "valori":[
				2040,
				2655,
				3111.85,
				3528.52,
				3948.14,
				4573.14,
				4848.14,
				5084.39,
				5178.90,
				5224.62,
				5819.62,
				6442.69,
				7611.93,
				8428.59,
				9479.09,
				10404.09,
				11506.59,
				12106.59,
				12651.04,
				12915.04,
				12985.04
			 ],
			 "color":"green",
			 "type":"spline",
			 "marker":"none"
		  }
	   ],
	   "hlines":[
		  {
			 "label":"BAC",
			 "valore":13055,
			 "color":"blue"
		  }
	   ],
	   "vlines":[

	   ],
	   "y-max":14000,
	   "y-min":0,
	   "y-tick-step":1500,
	   "y-label":"Valore in €",
	   "RTB":"In questo primo periodo, il gruppo è consapevole che il valore pianificato *PPV* risulti superiore a quanto prodotto nell'effettivo indicato dal *PEV*. Nonostante ciò, il gruppo è sempre riuscito a mantenere il valore del *PEV* non solo in crescita, ma anche superiore all'80% del *PPV*. \n Dall'analisi del grafico è evidenziabile come il *PPV* e il *PEV* abbiano valori sempre relativamente vicini, indicando che il lavoro svolto dal gruppo, seppur migliorabile, rimane in linea con quanto pianificato. L'analisi di questo andamento, pertanto, suggerisce un avanzamento positivo, ma che dovrà essere migliorato al fine di assorbire la differenza che intercorre tra i valori di *PPV* e *PEV*.",
	   "PB":"Durante il secondo periodo, il gruppo, come evidenziato dal grafico del primo periodo, si è impegnato ad assorbire la differenza tra *PEV* e *PPV*. Infatti, come è possibile evincere dal grafico, durante il corso degli Sprint del secondo periodo, *PEV* e *PPV* hanno avuto un andamento pressochè parallelo, con l'assottigliarsi della differenza che intercorreva inizialmente. Tale andamento è pertanto sinonimo di un completamento delle attività in linea con quanto preventivato, analisi supportata anche dalla metrica *CPI*. La maggiore confidenza con gli strumenti utilizzati e le automazioni impostate hanno svolto un ruolo fondamentale in questo processo.",
	   "caption":"Grafico rapporto tra PPV, PAC e PEV"
	},
	"CPI":{
	   "lines":[
		  {
			 "label":"CPI",
			 "valori":[
				0.98,
				1.01,
				0.99,
				1.00,
				0.97,
				1.01,
				0.99,
				1.00,
				0.98,
				0.97,
				0.97,
				0.98,
				1.02,
				1.01,
				1.02,
				1.02,
				1.03,
				1.02,
				1.02,
				1.03,
				1.02
			 ],
			 "color":"blue",
			 "type":"linear",
			 "marker":"o"
		  }
	   ],
	   "hlines":[
		  {
			 "label":"Limite superiore",
			 "valore":1.1,
			 "color":"green"
		  },
		  {
			 "label":"Limite inferiore",
			 "valore":0.8,
			 "color":"red"
		  }
	   ],
	   "vlines":[

	   ],
	   "y-max":1.2,
	   "y-min":0.6,
	   "y-tick-step":0.1,
	   "y-label":"CPI",
	   "RTB":"L'indice *CPI* risulta sempre in un range di valore accettabile. Seppur l'andamento non sia lineare, non si rilevano grandi variazioni, il che evidenzia un corretto avanzamento in termini di costi e lavoro prodotto. Il valore ottimale $>=1$ infatti, evidenza come il rapporto tra il lavoro svolto e il lavoro preventivato (in termini di costi) sia positivo, sinonimo di un avanzamento corretto.",
	   "PB":"Durante il secondo periodo del progetto didattico, data la maggiore confidenza con gli strumenti utilizzati e le automazioni impostate, il gruppo ha potuto mantenere un indice *CPI* sempre superiore a 1, permettendo l'assorbimento del differenza di valore tra *PPV* e *PEV*. Tale traguardo è stato reso possibile grazie al maggiore tempo a diposizione dei membri del gruppo a seguito della sessione d'esami: infatti, a maggiore disponibilità temporale si è tradotta nella possibilità di individuare/svolgere anche attività non preventivate all'inizio dello Sprint, permettendo di aumentare i ritmi di avanzamento. La dimunuzione del carico di lavoro, negli Sprint 22, 23 e 24 inoltre, ha permesso dunque di consolidare la metrica ad un valore superiore a 1.",
	   "caption":"Grafico CPI (Cost Performance Index)"
	},
	"BAC-EAC":{
	   "lines":[
		  {
			 "label":"EAC",
			 "valori":[
				13278.98,
				12882.90,
				13173.08,
				13004.98,
				13524.07,
				12903.30,
				13127.33,
				13107.92,
				13322.45,
				13480.74,
				13437.22,
				13292.70,
				12777.29,
				12987.48,
				12829.01,
				12824.00,
				12729.84,
				12762.13,
				12754.67,
				12736.55,
				12738.27
			 ],
			 "color":"red",
			 "type":"linear",
			 "marker":"triangle"
		  }
	   ],
	   "hlines":[
		  {
			 "label":"BAC",
			 "valore":13055,
			 "color":"green"
		  },
		  {
			 "label":"Limite superiore (BAC + 5%)",
			 "valore":13657.75,
			 "color":"red"
		  },
		  {
			 "label":"Limite inferiore",
			 "valore":12000,
			 "color":"blue"
		  }
	   ],
	   "vlines":[

	   ],
	   "y-max":16000,
	   "y-min":10000,
	   "y-tick-step":1000,
	   "y-label":"Valore in €",
	   "RTB":"Il valore dell'*EAC* oscilla attorno al valore del *BAC*. Il gruppo è consapevole che il valore stabilito dal *BAC* non possa essere superato, pertanto l'*EAC* al termine del progetto dovrà attenersi al rigido vincolo di $<=$ rispetto al *BAC*. I periodi più critici sono stati quelli relativi alle festività e alla sessione d'esame, come testimoniato anche all'interno del _Piano di Progetto_: in questi periodi infatti, il gruppo ha dovuto affrontare un rallentamento delle attività (seppur non una sospensione), che ha inevitabilmente portato ad una stima maggiore del costo finale. Risulta altresì, che però il gruppo, non avendo mai sospeso interamente le attività, ha potuto riprendere i lavori mediante un \"warm start\", e infatti, il valore dell'*EAC* a seguito dei periodi critici, è sempre rientrato nei limiti imposti dal *BAC*.",
	   "PB":"Durante il secondo periodo di progetto, come supportato anche dalle metriche *CPI* e *PEV*, il gruppo è riuscito a ridurre il valore dell'*EAC* rispetto al *BAC*. Infatti, come si può notare, a seguito dello Sprint 17, il valore dell'*EAC* è sempre stato inferiore al *BAC*, indicando un corretto avanzamento in termini di costi, testimoniato inoltre da un processo di codifica che non ha riscontrato particolari rallentamenti. La dimunuzione del carico di lavoro, negli Sprint 22, 23 e 24 inoltre, ha permesso dunque di consolidare la metrica ad un valore inferiore al *BAC*.",
	   "caption":"Grafico rapporto tra EAC e BAC"
	},
	"EO-Esterna":{
	   "lines":[
		  {
			 "label":"PdP",
			 "valori":[
				1,
				2,
				2,
				1,
				0,
				0,
				1,
				0,
				0,
				0,
				1,
				0,
				2,
				3,
				0,
				0,
				0,
				0,
				0,
				0,
				0
			 ],
			 "color":"blue",
			 "type":"linear",
			 "marker":"o"
		  },
		  {
			 "label":"PdQ",
			 "valori":[
				0,
				0,
				0,
				0,
				0,
				2,
				3,
				1,
				0,
				0,
				0,
				0,
				1,
				0,
				0,
				0,
				1,
				0,
				0,
				0,
				0
			 ],
			 "color":"red",
			 "type":"linear",
			 "marker":"o"
		  },
		  {
			 "label":"AdR",
			 "valori":[
				4,
				4,
				2,
				2,
				3,
				1,
				0,
				0,
				0,
				0,
				0,
				1,
				2,
				0,
				0,
				0,
				0,
				0,
				0,
				0
			 ],
			 "color":"green",
			 "type":"linear",
			 "marker":"o"
		  },
		  {
			 "label":"GLS",
			 "valori":[
				3,
				2,
				0,
				0,
				2,
				0,
				1,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0
			 ],
			 "color":"orange",
			 "type":"linear",
			 "marker":"o"
		  },
		  {
			 "label":"ST",
			 "valori":[
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				1,
				1,
				0,
				0,
				0,
				0,
				0,
				0
			 ],
			 "color":"purple",
			 "type":"linear",
			 "marker":"o"
		  },
		  {
			 "label":"MU",
			 "valori":[
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				1,
				0,
				0,
				0,
				0
			 ],
			 "color":"yellow",
			 "type":"linear",
			 "marker":"o"
		  }
	   ],
	   "hlines":[

	   ],
	   "vlines":[

	   ],
	   "y-max":8,
	   "y-min":0,
	   "y-tick-step":1,
	   "y-label":"Numero di errori",
	   "RTB":"",
	   "PB":"",
	   "caption":"Grafico andamento EO (Errori Ortografici) nella documentazione esterna"
	},
	"EO-Interna":{
	   "lines":[
		  {
			 "label":"NdP",
			 "valori":[
				2,
				3,
				4,
				3,
				3,
				2,
				1,
				1,
				0,
				0,
				0,
				1,
				2,
				0,
				2,
				1,
				0,
				0,
				0,
				0,
				0
			 ],
			 "color":"blue",
			 "type":"linear",
			 "marker":"o"
		  }
	   ],
	   "hlines":[

	   ],
	   "vlines":[

	   ],
	   "y-max":8,
	   "y-min":0,
	   "y-tick-step":1,
	   "y-label":"Numero di errori",
	   "RTB":"Gli errori ortografici nella documentazione rispecchiano i periodi in cui i documenti hanno subito la maggior parte delle modifiche. In particolare: \n - *Documentazione esterna*: \n\t - *PdP*: il documento ha inizialmente subito la maggior parte di aggiunte a livello testuale, come le sezioni di introduzione, amministrazione dei periodi e dei ruoli. Successivamente gli aggiornamenti sono stati minori, atti alla registrazione e al tracciamento dei preventivi e consuntivi dei vari periodi. Inoltre, l'implementazione di un sistema di creazione automatico delle tabelle dei preventivi e dei consuntivi implementato in _Google Apps Script_, ha permesso di ridurre ulteriormente l'insorgenza di errori; \n\t - *PdQ*: l'insorgenza di errori all'interno del _Piano di Qualifica_ è dettata dall'inizio della sua stesura dallo Sprint 9; \n\t - *AdR*: data la natura del periodo di RTB, il documento _Analisi dei Requisiti_ è tra i documenti più corposi e maggiormente soggetti a revisioni e modifiche. Inoltre, l'incremento dei numero di errori è dovuto non solo a revisioni interne ma anche a modifiche dettate da revisioni esterne con i professori; \n\t - *Glossario*: il _Glossario_ è stato soggetto a relativamente poche modifiche; la maggior parte degli errori è stata riscontrata inizialmente. \n - *Documentazione interna*: \n\t - *NdP*: l'adozione dello standard ISO/IEC 12207:2017 ha portato con sè anche un grado di complessità maggiore nella stesura del documento, il quale è aumentato di dimensione e complessità. La maggior parte degli errori è pertanto riscontrabile nel periodo di maggiore stesura, per poi ridursi quando le sezioni del documento inerenti e utili al periodo sono state redatte.",
	   "PB":"Come anche per il periodo RTB, i documenti hanno rilevato un maggior numero di errori ortografici nel periodo di maggiore stesura. Nonostante ciò, la maggiore confidenza con la redazione dei documenti, ha permesso di ridurre notevolmente il numero di errori riscontrati. In particolare: \n - *Documentazione esterna*: \n\t - *PdP*: il documento ha subito modifche consistenti per rispondere alle criticità riscontrate alla valutazione RTB, aumentando il grado di analisi e dettaglio. Nonostante ciò, il numero di errori ortografici presenti non è mai stato eccessivo, per poi stabilizzarsi dallo Sprint 18; \n\t - *PdQ*: il documento ha subito modifche consistenti per rispondere alle criticità riscontrate alla valutazione RTB, aumentando il grado di analisi e dettaglio.. In particolare è stata redatta l'intera sezione di metriche di qualità riferite al prodotto e la sezione dei test condotti. In particolare infatti, durante i periodi 18, 19 e 20 il documento ha visto la redazione delle sezioni dedicate alle suite di test; \n\t - *AdR*: il documento ha subito modifche consistenti per rispondere alle criticità riscontrate alla valutazione RTB, aumentando il grado di analisi e dettaglio. L'aggiornamento di tale documento infatti ha avuto la priorità per permettere al gruppo di iniziare il processo di codifica in modo solido. La versione aggiornata del documento è stata inoltre valutata positivamente anche dal Professor Cardin. \n\t - *Glossario*: Il glossario non ha subito grandi modifiche, stabilizzando il numero di errori ortografici a 0, e le modifiche successive, di dimensioni ridotte, non hanno presentato errori. \n\t - *Specifica Tecnica*: Il documento ha visto la sua redazione dal periodo 17 al 20, precedente all'inzio del processo di codifica, in modo da evidenziare e fissare le scelte progettuali (design). Il numero di errori ortografici è stato contenuto; \n\t - *Manuale utente*: Il documento non ha riscontrato un numero elevato di errori ortografici. La sua redazione è iniziata nello Sprint 19, in quanto si voleva attendere che il prodotto software assumesse una forma delineata in modo concreto. \n - *Documentazione interna*: \n\t - *NdP*: il documento non ha subito modifiche in termini di struttura e contenuto, quanto più un'estensione per affrontare le nuove attività che il gruppo ha dovuto svolgere, in particolare in merito ai processi di progettazione, codifica e verifica. La sua redazione è conclusa nello Sprint 20, stabilizzando a 0 il numero di errori individuati.",
	   "caption":"Grafico andamento EO (Errori Ortografici) nella documentazione interna"
	},
	"MS":{
	   "lines":[
		  {
			 "label":"MS",
			 "valori":[
				78,
				89,
				78,
				89,
				67,
				89,
				78,
				67,
				67,
				67,
				89,
				78,
				89,
				89,
				89,
				89,
				89,
				100,
				100,
				100,
				100
			 ],
			 "color":"red",
			 "type":"linear",
			 "marker":"triangle"
		  }
	   ],
	   "hlines":[
		  {
			 "label":"Valore ottimale",
			 "valore":100,
			 "color":"green"
		  },
		  {
			 "label":"Valore accettabile",
			 "valore":75,
			 "color":"red"
		  }
	   ],
	   "vlines":[

	   ],
	   "y-max":110,
	   "y-min":50,
	   "y-tick-step":5,
	   "y-label":"Valore in %",
	   "RTB":"La percentuale di metriche soddisfatte risulta per la maggior parte degli Sprint superiore alla soglia di accettabilità del 75%. I periodi in cui tale soglia non è stata raggiunta sono gli Sprint 8, 11, 12 e 13 in quanto: \n - Sprint 8: periodo dal 26/12/2023 al 02/01/2024, caratterizzato da festività natalizie e di fine anno; \n - Sprint 11, 12, 13: periodo dal 15/01/2024 al 05/02/2024, caratterizzato dalla sessione d'esami. \n Il valore della metrica, sempre superiore alla soglia di accettazione, indica che il gruppo ha compreso quanto stabilito dal _way of working_. Il motivo del mancato raggiungimento della totalità delle metriche soddisfatte è dovuto a errori ortografici presenti nei documenti, che portano alla mancata soddisfazione della metrica *EO*.",
	   "PB":"Rispetto al primo periodo RTB, l'andamento della metrica *MS* è stato più costante e con valore superiore alla soglia di accettazione, raggiungendo il valore ottimale dallo Sprint 21. Tale risultato è stato reso possibile dalla maggiore confidenza con il _way of working_ e la redazione dei documenti. Infatti, come anche sostenuto dalle metriche *PPV*, *CPI* e *EO*, il gruppo ha lavorato in modo costante e con ritmi in linea con la pianificazione impostata. Tale andamento della metrica, evidenzia un corretto avanzamento del gruppo e la comprensione delle criticità emerse durante il primo periodo di RTB. Il gruppo pertanto si ritiene soddisfatto del risultato ottenuto.",
	   "caption":"Grafico andamento MS (Metriche soddisfatte)"
	},
	"MRC":{
	   "lines":[
		  {
			 "label":"MRC",
			 "valori":[
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				12,
				26,
				64,
				100,
				100,
				100,
				100,
				100,
				100,
				100,
				100,
				100,
				100
			 ],
			 "color":"blue",
			 "type":"linear",
			 "marker":"o"
		  }
	   ],
	   "hlines":[
		  {
			 "label":"Valore ottimale",
			 "valore":100,
			 "color":"green"
		  },
		  {
			 "label":"Valore accettabile",
			 "valore":100,
			 "color":"red"
		  }
	   ],
	   "vlines":[

	   ],
	   "y-max":110,
	   "y-min":0,
	   "y-tick-step":10,
	   "y-label":"Valore in %",
	   "RTB":"",
	   "PB":"Dall'analisi del grafico è evidenziabile come il gruppo abbia raggiunto il soddisfacimento di tutti i requisiti obbligatori individuati. Tale traguardo è stato una priorità. Il raggiungimento di tale traguardo è frutto di un processo di codifica mirato, che vede inizio nello Sprint 17 durante il quale è stato configurato l'intero ambiente di sviluppo e poste le basi per la codebase. Tra il periodo 17 e 19, data l'implementazione della struttura portante del codice, il raggiungimento dei requisiti obbligatori è stato massimo, raggiungendo la totalità nel periodo 20.",
	   "caption":"Grafico andamento MRC (Mandatory Requirements Coverage)"
	},
	"DRC":{
	   "lines":[
		  {
			 "label":"DRC",
			 "valori":[
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				10,
				42,
				73,
				88,
				88,
				88,
				88,
				88,
				88,
				88,
				88,
				88
			 ],
			 "color":"blue",
			 "type":"linear",
			 "marker":"o"
		  }
	   ],
	   "hlines":[
		  {
			 "label":"Valore ottimale",
			 "valore":100,
			 "color":"green"
		  },
		  {
			 "label":"Valore accettabile",
			 "valore":75,
			 "color":"red"
		  }
	   ],
	   "vlines":[

	   ],
	   "y-max":110,
	   "y-min":0,
	   "y-tick-step":10,
	   "y-label":"Valore in %",
	   "RTB":"",
	   "PB":"Come anche annunciato durante il secondo colloquio RTB, il gruppo ha impostato il lavoro al fine di coprire non solo i requisiti obbligatori, ma anche quelli desiderabili e opzionali. Il gruppo quindi soddisfa l'88% dei requisiti desiderabili individuati. L'implementazione del codice per il loro soddisfacimento, come è possibile notare dal grafico, trova luogo dallo Sprint 17, successivo dunque all'inizio della codifica dei requisiti obbligatori. Dato che il gruppo era già deciso a coprire anche i requisiti desiderabili, la loro implementazione non ha impattato la pianificazione o il soddisfacimento dei requisiti obbligatori, ma anzi, ha trovato luogo in modo parallelo. La copertura, seppur non totale, ha superato la soglia di accettazione, e la loro implementazione è terminata durante lo Sprint 21: infatti a seguito del totale soddisfacimento dei requisiti obbligatori, il gruppo ha potuto concentrarsi sui requisiti desiderabili e opzionali. Il gruppo inoltre vuole evidenziare come i requisiti desiderabili non raggiunti (7 in totale), non rappresentino funzionalità critiche mancanti, bensì solamente modifiche grafiche minori.",
	   "caption":"Grafico andamento DRC (Desiderable Requirements Coverage)"
	},
	"ORC":{
	   "lines":[
		  {
			 "label":"ORC",
			 "valori":[
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				10,
				22,
				61,
				90,
				100,
				100,
				100,
				100,
				100,
				100,
				100,
				100
			 ],
			 "color":"blue",
			 "type":"linear",
			 "marker":"o"
		  }
	   ],
	   "hlines":[
		  {
			 "label":"Valore ottimale",
			 "valore":100,
			 "color":"green"
		  },
		  {
			 "label":"Valore accettabile",
			 "valore":75,
			 "color":"red"
		  }
	   ],
	   "vlines":[

	   ],
	   "y-max":110,
	   "y-min":0,
	   "y-tick-step":10,
	   "y-label":"Valore in %",
	   "RTB":"",
	   "PB":"Come anche annunciato durante il secondo colloquio RTB, il gruppo ha impostato il lavoro al fine di coprire non solo i requisiti obbligatori, ma anche quelli desiderabili e opzionali. Il gruppo quindi soddisfa la totalità dei requisiti opzionali individuati. Allo stesso modo di quanto avvenuto per i requisiti desiderabili, l'implementazione del codice per il loro soddisfacimento, come è possibile notare dal grafico, trova luogo dallo Sprint 17, successivo dunque all'inizio della codifica dei requisiti obbligatori. Dato che il gruppo era già deciso a coprire anche i requisiti opzionali, la loro implementazione non ha impattato la pianificazione o il soddisfacimento dei requisiti obbligatori, ma anzi, ha trovato luogo in modo parallelo. Come avvenuto anche per i requisiti desiderabili, al termine del soddisfacimento dei requisiti obbligatori avvenuto nello Sprint 20, il gruppo ha potuto concentrarsi sull'ultimare il soddisfacimento dei requisiti opzionali nello Sprint 21. Tale traguardo ha trovato riscontro estremamente positivo anche da parte del Proponente.",
	   "caption":"Grafico andamento ORC (Optional Requirements Coverage)"
	},
	"CCV":{
	   "lines":[
		  {
			 "label":"CCV",
			 "valori":[
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				30,
				77,
				92,
				92,
				92,
				92,
				92,
				92,
				92,
				92,
				92,
				92,
				92
			 ],
			 "color":"blue",
			 "type":"linear",
			 "marker":"triangle"
		  }
	   ],
	   "hlines":[
		  {
			 "label":"Valore ottimale",
			 "valore":100,
			 "color":"green"
		  },
		  {
			 "label":"Valore accettabile",
			 "valore":80,
			 "color":"red"
		  }
	   ],
	   "vlines":[

	   ],
	   "y-max":110,
	   "y-min":0,
	   "y-tick-step":10,
	   "y-label":"Valore in %",
	   "RTB":"",
	   "PB":"Il gruppo ha raggiunto un livello più che accettabile di Code Coverage pari al 92%. Durante i periodi 16 e 17, dove ancora la codebase era nel suo stadio inziale, la metrica risulta insoddisfatta. Inoltre è importante precisare come l'inesperienza del gruppo nella progettazione e implementazione di test efficaci abbia comportato un rallentamento iniziale nella loro stesura e codifica. Nonostante questo primo rallentamento, una volta acquisita maggiore confidenza con Jest (framework utilizzato per l'implementazione dei test), i tempi di implementazione dei test è stato notevolemente ridotto, non impattanto sulla codifica del codice vero e proprio. Come evidenziato anche dalle metriche _MRC_, _DRC_ e _ORC_, i periodi di maggiore sviluppo sono compresi tra lo Sprint 17 e 20, dove anche la metrica _CCV_ ha raggiunto il suo massimo. La stesura dei test ha permesso di individuare e correggere errori in modo tempestivo.",
	   "caption":"Grafico andamento CCV (Codo Coverage)"
	},
	"BCV":{
	   "lines":[
		  {
			 "label":"BCV",
			 "valori":[
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				30,
				60,
				71,
				71,
				71,
				71,
				71,
				71,
				71,
				71,
				71,
				71,
				71
			 ],
			 "color":"blue",
			 "type":"linear",
			 "marker":"triangle"
		  }
	   ],
	   "hlines":[
		  {
			 "label":"Valore ottimale",
			 "valore":100,
			 "color":"green"
		  },
		  {
			 "label":"Valore accettabile",
			 "valore":70,
			 "color":"red"
		  }
	   ],
	   "vlines":[

	   ],
	   "y-max":110,
	   "y-min":0,
	   "y-tick-step":10,
	   "y-label":"Valore in %",
	   "RTB":"",
	   "PB":"Il gruppo ha raggiunto un livello accettabile di Branch Coverage pari al 71%. Similmente a quanto accade alla metrica CCV indicante il Code Coverage, la Branch Coverage ha risentito di un rallentamento iniziale dovuto all'inesperienza del gruppo nella progettazione e implementazione di test efficaci. Inoltre, la Branch Coverage possiede una natura più complessa, dovuta all'analisi dei diversi percorsi condizionali che il codice può assumere. Nonostante questo, il gruppo si è impegnato a raggiungere un livello di copertura accettabile. Allo stesso modo della metrica CCV, il soddisfacimento della metrica avviene solamente a seguito dello Sprint 18, nei periodi di maggiore sviluppo del progetto.",
	   "caption":"Grafico andamento BCV (Branch Converage)"
	},
	"FD":{
	   "lines":[
		  {
			 "label":"FD",
			 "valori":[
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				10,
				0,
				8,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0,
				0
			 ],
			 "color":"blue",
			 "type":"linear",
			 "marker":"triangle"
		  }
	   ],
	   "hlines":[
		  {
			 "label":"Valore ottimale",
			 "valore":0,
			 "color":"green"
		  },
		  {
			 "label":"Valore accettabile",
			 "valore":0,
			 "color":"red"
		  }
	   ],
	   "vlines":[

	   ],
	   "y-max":100,
	   "y-min":0,
	   "y-tick-step":10,
	   "y-label":"Valore in %",
	   "RTB":"",
	   "PB":"Dall'analisi del grafico è possibile notare l'andamento della metrica _FD_ che indica la percentuale di test falliti sul totale di test implementati. L'obiettivo del processo di testing è quello di evidenziare eventuali errori all'interno del codice in modo da poter intervenire in modo efficace ed efficente per la loro correzione. I periodi in cui il gruppo ha riscontrato un numero maggiore di test falliti sono stati lo Sprint 17 e 19, corrispondenti ai periodi di maggiore sviluppo dell'applicativo. Essere riusciti a individuare prontamente gli errori all'interno del codice, ha permesso di non impattare negativamente sulla pianificazione delle attività, contribuendo alla realizzazione di un prodotto software di qualità. Il valore della metrica _FD_ sceso a 0 a seguito del periodo 20, indica che il prodotto software supera con successo tutti i test implementati. Questo traguardo è stato reso possibile grazie all'implementazione di un efficace sistema di Continuous Integration e Continuous Deployment configurato mediante GitHub Actions.",
	   "caption":"Grafico andamento FD (failure density)"
	}
 }